In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

### Delete from buys table en mass by stock name

In [20]:
sql = '''
SELECT * FROM buys LIMIT 1'''
buys = pd.read_sql(sql, conpf)
buys.columns

Index(['id', 'stock_id', 'date', 'qty', 'price', 'fee', 'vat', 'status', 'net',
       'kind', 'chart'],
      dtype='object')

In [21]:
sql = '''
SELECT * FROM stocks LIMIT 1'''
stocks = pd.read_sql(sql, conpf)
stocks.columns

Index(['id', 'name', 'category_id', 'website'], dtype='object')

In [23]:
sql = '''
SELECT * FROM stocks WHERE name = "NOBLE"'''
stocks = pd.read_sql(sql, conpf)
stocks

    id   name  category_id website
0  145  NOBLE            3

In [32]:
id = 145
sql = '''
SELECT * 
FROM buys
WHERE stock_id = %s
AND status = "Active"
AND qty < 63000
'''
sql = sql % id
df = pd.read_sql(sql, conpf)
df

,id,stock_id,date,qty,price,fee,vat,status,net,kind,chart
0,895,145,2021-05-13,6000,7.20,89.42,6.26,Active,43295.68,HD,None
1,889,145,2021-05-11,6000,8.00,99.36,6.96,Active,48106.32,HD,None
2,987,145,2021-08-13,6000,6.50,80.73,5.65,Active,39086.38,HD,None
3,1082,145,2021-12-20,21000,6.10,265.17,18.56,Active,128383.73,HD,None
4,1039,145,2021-11-03,6000,6.40,79.49,5.56,Active,38485.05,HD,None
5,1058,145,2021-11-29,6000,6.25,77.63,5.43,Active,37583.06,HD,None

In [33]:
df.qty.sum()

51000

In [34]:
sqlDel = '''
DELETE 
FROM buys
WHERE stock_id = 145
AND status = "Active"
AND qty < 63000
'''
print(sqlDel)

DELETE
FROM buys
WHERE stock_id = 145
AND status = "Active"
AND qty < 63000

In [35]:
rp = conpf.execute(sqlDel)
rp.rowcount

6